In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv("titanic.csv")
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [4]:
y=data["Survived"]
X=data.drop(["PassengerId","Survived","Name","SibSp","Parch","Ticket","Cabin","Embarked"], axis="columns")

In [5]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [6]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  418 non-null    int64
 1   Sex     418 non-null    object
 2   Age     332 non-null    float64
 3   Fare    417 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 13.2+ KB

In [7]:
Age_mean = X["Age"].mean()
Age_mean

30.272590361445783

In [8]:
X['Age'].fillna(value=Age_mean, inplace=True)

In [9]:
# data.isnull().sum()

In [10]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  418 non-null    int64
 1   Sex     418 non-null    object
 2   Age     418 non-null    float64
 3   Fare    417 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 13.2+ KB

In [11]:
data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin           True
Embarked       False
dtype: bool

In [12]:
Fare_mean = X["Fare"].mean()
Fare_mean

35.6271884892086

In [13]:
X['Fare'].fillna(value=Fare_mean, inplace=True)

In [14]:
X.isnull().any()

Pclass    False
Sex       False
Age       False
Fare      False
dtype: bool

In [15]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  418 non-null    int64
 1   Sex     418 non-null    object
 2   Age     418 non-null    float64
 3   Fare    418 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 13.2+ KB

In [16]:
# Conerting float type of fare into int
X['Fare'] = X['Fare'].astype(int)
X['Age'] = X['Age'].astype(int)

In [17]:
X.head()

   Pclass     Sex  Age  Fare
0       3    male   34     7
1       3  female   47     7
2       2    male   62     9
3       3    male   27     8
4       3  female   22    12

In [18]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  418 non-null    int64
 1   Sex     418 non-null    object
 2   Age     418 non-null    int32
 3   Fare    418 non-null    int32
dtypes: int32(2), int64(1), object(1)
memory usage: 9.9+ KB

In [19]:
from sklearn.preprocessing import LabelEncoder
le_sex=LabelEncoder()
X['Sex_n']=le_sex.fit_transform(X["Sex"])

In [20]:
print(X.head())

   Pclass     Sex  Age  Fare  Sex_n
0       3    male   34     7      1
1       3  female   47     7      0
2       2    male   62     9      1
3       3    male   27     8      1
4       3  female   22    12      0

In [21]:
X_n= X.drop(["Sex"],axis="columns")
print(X_n.head(10))

   Pclass  Age  Fare  Sex_n
0       3   34     7      1
1       3   47     7      0
2       2   62     9      1
3       3   27     8      1
4       3   22    12      0
5       3   14     9      1
6       3   30     7      0
7       2   26    29      1
8       3   18     7      0
9       3   21    24      1

In [22]:
from sklearn.tree import DecisionTreeClassifier
dtc = DecisionTreeClassifier(max_depth=6)
dtc.fit(X_n, y)

DecisionTreeClassifier(max_depth=6)

In [23]:
dtc.score(X_n,y)

1.0

In [24]:
dtc.predict([[3,29,7,0]])

array([1], dtype=int64)

In [25]:
dtc.predict([[2,26,29,1]])

array([0], dtype=int64)